Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་ཅིང་། དེ་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: Śakra then said, “Blessed Lord, if any noble son or noble daughter were to commit this perfection of wisdom to writing and take up, uphold, recite, master, {Ki.

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བགྱིས། བཀུར་སྟིར་བགྱིས། བསྟི་སྟང་དུ་བགྱིས། མཆོད་པར་བགྱིས་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: II-III: 67} and focus their attention correctly on it, and were then to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit of that one would increase manifold to a greater extent than the former.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་ནང་དུ་དགེ་བའི་ཆོས་ཐམས་ཅད་འདུས་ཏེ། འདི་ལྟར་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་།
en: If one were to ask why, Blessed Lord, it is because all virtuous attributes are gathered within this perfection of wisdom.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་བཞི་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡང་འདུས་སོ།
en: That is to say, the paths of the ten virtuous actions, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the gateways to liberation—emptiness, signlessness, and wishlessness—the four truths of the noble ones comprising suffering, its cause, its cessation, and the path [leading to its cessation], the six extrasensory powers, the eight aspects of liberation, the nine serial steps of meditative absorption, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, are indeed gathered within it.

source: །དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བསྟན་པ་སྟེ།
en: This is the teaching of the lord buddhas.

source: དེ་ལ་བསླབས་ཤིང་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པར་གྱུར་ཏོ།
en: Training in it, the śrāvakas, pratyekabuddhas, and all the lord buddhas of the past, future, and present have transcended, are transcending, and will transcend all phenomena.”

source: །ཕྱིན་ཏོ། ཕྱིན་པར་འགྱུར་རོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་བཅྭོ་བརྒྱད་པའོ།། །།
en: This completes the eighteenth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ།
en: Chapter 19 Then the Blessed One replied to Śakra, mighty lord of the gods, “Kauśika, it is so!

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བསོད་ནམས་མང་དུ་འཕེལ་ལོ།
en: The merit of those noble sons or noble daughters will increase manifold.

source: །གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཤིང་གླེགས་བམ་དུ་བྱས་ཏེ་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་། གོང་དུ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། དེའི་ཕྱིར་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བསོད་ནམས་ནི་ཚད་མེད་གྲངས་མེད་བསམ་གྱིས་མི་ཁྱབ་མཚུངས་པ་མེད། དཔག་ཏུ་མེད་པར་འཕེལ་ལོ།
en: If any of them were to commit this perfection of wisdom to writing, making it into a book, and then take up, uphold, recite, master, and focus their attention correctly on it, and in addition were then to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit of those noble sons or noble daughters would be immeasurable, uncountable, inconceivable, incomparable, and it would increase inestimably.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་ལྔ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་།
en: If you ask why, Kauśika, the all-aspect omniscience of the tathāgatas, arhats, completely awakened buddhas has originated from the perfection of wisdom.

source: སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྤྱན་ལྔ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པའོ།།
en: The other five perfections, the emptiness of internal phenomena, [the other aspects of emptiness] up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, the distinct qualities of the buddhas, the five eyes of the tathāgatas, the maturation of beings, and the refinement of the buddhafields have all originated from the perfection of wisdom. “

source: ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི། ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ།
en: Kauśika, knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience have all originated from the perfection of wisdom. {

source: །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། ཐེག་པ་ཆེན་པོའོ།
en: Ki.II-III: 68} Kauśika, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the Great Vehicle have all originated from the perfection of wisdom.

source: །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་བྱུང་བ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ། །ཀཽ་ཤི་ཀ་དེ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བྲིས་ཏེ། གླེགས་བམ་དུ་བྱས་ཤིང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། སྤོས་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་།
en: Kauśika, unsurpassed, complete enlightenment has originated from the perfection of wisdom. “

source: སིལ་སྙན་སྣ་ཚོགས་ཀྱིས་རིམ་གྲོར་བྱས། བཀུར་སྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པར་བྱས་ན། བསོད་ནམས་མངོན་པར་འདུ་བྱ་བ་འདི་ལ་བསོད་ནམས་མངོན་པར་འདུ་བྱ་བ་སྔ་མས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་། བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་བྱེ་བའི་ཆ་དང་། བྱེ་བ་བརྒྱའི་ཆ་དང་། བྱེ་བ་སྟོང་གི་ཆ་དང་།
en: Kauśika, so it is that if any noble sons or noble daughters were to commit this perfection of wisdom to writing, making it into a book, and then take up, uphold, recite, master, and focus their attention correctly on it, and in addition were then to serve, respect, honor, and worship it with flowers, garlands, perfumes, unguents, powders, robes, parasols, victory banners, ribbons, and various musical sounds, the merit accrued by the former [acts of building stūpas] would come nowhere near even a hundredth part of this merit that is now accrued.

source: བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་། གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེར་ཡང་ཉེ་བར་མི་འགྲོ།
en: It would come nowhere near even a thousandth part of it, or a hundred thousandth part, a billionth part, a ten billionth part, a trillionth part, or any number, fraction, calculation, or exemplar.

source: རྒྱུར་ཡང་མི་བཟོད་དོ།
en: It would stand no comparison.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཇི་སྲིད་དུ་འཛམ་བུའི་གླིང་དུ་གནས་པ་དེ་སྲིད་དུ། སངས་རྒྱས་དཀོན་མཆོག་ནུབ་པར་མི་འགྱུར་རོ། །ཆོས་དཀོན་མཆོག་ནུབ་པར་མི་འགྱུར་རོ། །དགེ་འདུན་དཀོན་མཆོག་ནུབ་པར་མི་འགྱུར་རོ།
en: If you ask why, Kauśika, as long as this perfection of wisdom dwells in Jambudvīpa, the precious jewel of the Buddha will not disappear, the precious jewel of the Dharma will not disappear, and the precious jewel of the Saṅgha will not disappear. “[

source: །དེ་སྲིད་དུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་།
en: As long this perfection of wisdom dwells in Jambudvīpa], the paths of the ten virtuous actions, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the nine serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, the eighteen distinct qualities of the buddhas, and [all the fruits and realizations], up to and including all-aspect omniscience, will appear in the world. “[

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །དེ་སྲིད་དུ་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་དང་། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་དང་། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །རྒྱུན་དུ་ཞུགས་པ་རྣམས་དང་།
en: As long this perfection of wisdom dwells in Jambudvīpa], the great and lofty royal families, the great and lofty priestly families, the great and lofty householder families, the gods of the Caturmahā­rāja­kāyika realm, and the gods of the Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms, and [of all other realms], up to and including Akaniṣṭha, will appear in the world. “[

source: ལན་ཅིག་ཕྱིར་འོང་བ་རྣམས་དང་། ཕྱིར་མི་འོང་བ་རྣམས་དང་། དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: As long this perfection of wisdom dwells in Jambudvīpa], those who have entered the stream to nirvāṇa, those who are destined for only one more rebirth, those who are no longer subject to rebirth, and those who are arhats, pratyekabuddhas, bodhisattvas, and completely awakened buddhas will appear in the world. “[

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འབྱུང་བ་ཡོད་དོ། །བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཡོད་དོ།
en: As long this perfection of wisdom dwells in Jambudvīpa], bodhisattva great beings will be discerned, and the wisdom of unsurpassed buddhahood, the turning of the wheel of the Dharma, the maturation of beings, and the refinement of the buddhafields will be discerned.”

source: །དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་གང་ཇི་སྙེད་ཡོད་པ་དེ་དག་ལ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་སྨྲས་པ། གྲོགས་པོ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གཟུང་བར་བྱའོ། །བཅང་བར་བྱའོ།
en: Then, in this world system of the great trichiliocosm, Śakra, mighty lord of the gods, addressed the gods of the Caturmahā­rāja­kāyika realm {Ki.

source: །ཀླག་པར་བྱའོ། །ཀུན་ཆུབ་པར་བྱའོ། །ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱའོ། གྲོགས་པོ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བཟུང་བ་དང་། བཅངས་པ་དང་། བླགས་པ་དང་།
en: II-III: 69} and [all those of the other realms], up to and including Akaniṣṭha, saying, “Friends, you should take up this perfection of wisdom, uphold, recite, master, and focus your attention correctly on it.

source: ཀུན་ཆུབ་པར་བྱས་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱས་པས་ནི། སངས་རྒྱས་ཀྱི་ཚུལ་རྒྱུན་ཆད་པར་མི་འགྱུར་རོ། །ཆོས་ཀྱི་ཚུལ་རྒྱུན་ཆད་པར་མི་འགྱུར་རོ། །དགེ་འདུན་གྱི་ཚུལ་རྒྱུན་ཆད་པར་མི་འགྱུར་རོ།
en: Friends, those who take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom will not interrupt the ways of the buddhas, they will not interrupt the ways of the Dharma, and they will not interrupt the ways of the saṅgha.

source: །གྲོགས་པོ་དག་དཀོན་མཆོག་གསུམ་གྱི་ཚུལ་རྒྱུན་མ་ཆད་ན། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: Friends, when the ways of the Three Precious Jewels are not interrupted, all the perfections will appear in the world.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་།
en: The emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, the gateways to liberation—emptiness, signlessness, and wishlessness—the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, the distinct qualities of the buddhas, the conduct of the bodhisattvas, the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and unsurpassed, complete enlightenment will appear in the world.”

source: དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་བཀའ་སྩལ་བ། ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཟུང་ཤིག །
en: Then the Blessed One said to Śakra, mighty lord of the gods, “Kauśika, you should take up this perfection of wisdom.

source: ཆོངས་ཤིག །
en: Uphold it!

source: ལྷོགས་ཤིག །
en: Recite it!

source: ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: Master it!

source: ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཚུལ་བཞིན་དུ་ཡིད་ལ་གྱིས་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Kauśika, you should focus your attention correctly on this perfection of wisdom!

source: ཀཽ་ཤི་ཀ་ནམ་ལྷ་མ་ཡིན་རྣམས་འདི་སྙམ་དུ་སེམས་ཤིང་། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་ཐབ་མོ་བྱའོ། །སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་མཚམས་བརྡལ་ལོ་སྙམ་ན་དེའི་ཚེ། ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡིད་ཀྱིས་སོམས་ལ་ཁ་ཏོན་གྱིས་ཤིག །ཚུལ་བཞིན་དུ་ཡིད་ལ་གྱིས་ཤིག་དང་།
en: If you ask why, Kauśika, whenever the asuras think they should fight with the gods of the Trayastriṃśa realm and breach their frontier, at that time, Kauśika, you should contemplate this perfection of wisdom, chant it, and focus your attention correctly on it.

source: དེས་ལྷ་མ་ཡིན་གྱི་བསམ་པ་དེ་དག་ཕྱིར་ནུབ་པར་འགྱུར་ཏེ། སེམས་བསྐྱེད་པ་དེ་དག་སློས་ཤིང་རྣམ་པར་འཕེལ་བར་མི་འགྱུར་རོ།
en: Thereby those intentions of the asuras will again fade away and their [bellicose] mindsets will be assuaged, and will not flourish. “

source: །ལྷའི་བུ་དང་ལྷའི་བུ་མོ་གང་དག་ཤི་འཕོ་བའི་ཚེ། ནམ་བདག་ཅག་ངན་སོང་སུ་སྐྱེ་བར་མཐོང་ན་ཡང་། ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱིས་དེ་དག་གི་མདུན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཁ་ཏོན་དུ་གྱིས་ཤིག་དང་། དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐོས་པའི་དགེ་བའི་རྩ་བ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མོས་པས་ལྷའི་གནས་དེ་ཉིད་དུ་སྐྱེ་བར་འགྱུར་རོ།
en: Whenever the gods and goddesses are about to die and transmigrate, even when they see that they will be reborn in the lower realms, you, Kauśika, should chant this perfection of wisdom in their presence and they will be reborn in this same god realm owing to the root of the virtuous action of hearing the perfection of wisdom and owing to their devotion to the perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཐོས་པ་ནི་དེ་ལྟར་དོན་དང་ལྡན་པ་སྟེ།
en: If you ask why, Kauśika, it is advantageous to hear this perfection of wisdom in that manner.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་སུ་ཡང་རུང་སྟེ། དེ་དག་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཐོས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དགེ་བའི་རྩ་བ་དེས་མཐར་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Whichever noble sons or noble daughters hear this perfection of wisdom, {Ki.II-III: 70} they will all through this root of virtue finally attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་འདས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཇི་སྙེད་ཅིག་བྱུང་བ་དེ་དག་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་བསླབས་ནས། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་སོ།
en: If you ask why, Kauśika, it is because however many tathāgatas, arhats, completely awakened buddhas of the past there were, along with their communities of śrāvakas, they all attained final nirvāṇa in the expanse of nirvāṇa where no aggregates are left behind, having trained in this perfection of wisdom.

source: མ་འོངས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཇི་སྙེད་ཅིག་འབྱུང་བ་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབས་ཤིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: However many tathāgatas, arhats, completely awakened buddhas of the future there will be, along with their communities of śrāvakas, they will all attain consummate buddhahood in unsurpassed, complete enlightenment, having trained in this perfection of wisdom.

source: །ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་བསླབས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: However many tathāgatas, arhats, completely awakened buddhas are alive at present, residing in the world systems of the ten directions, along with their communities of śrāvakas, they all attain consummate buddhahood in unsurpassed, complete enlightenment, having trained in this perfection of wisdom.

source: ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་ནང་དུ་ཉན་ཐོས་ཀྱི་ཆོས་སམ། རང་སངས་རྒྱས་ཀྱི་ཆོས་སམ། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སམ། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་རུང་སྟེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་འདུས་སོ།
en: If you ask why, Kauśika, it is because all the factors conducive to enlightenment are gathered within this perfection of wisdom, whether they are those of the śrāvakas, those of the pratyekabuddhas, those of the bodhisattvas, or those of the buddhas.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རིག་སྔགས་ཆེན་མོའོ།
en: Śakra then said, “Blessed Lord, this perfection of wisdom is the great knowledge.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བླ་ན་མེད་པའི་རིག་སྔགས་སོ།
en: Blessed Lord, this perfection of wisdom is the unsurpassed knowledge.

source: །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མི་མཉམ་པ་དང་མཉམ་པའི་རིག་སྔགས་སོ།
en: Blessed Lord, this perfection of wisdom is the knowledge that is equal to the unequaled.
